CD2DLayer.m_pLayer
Stores a pointer to an ID2D1Layer object.

CD2DLayer.Destroy
Destroys a CD2DLayer object.

CD2DLayer.Create(CRenderTarget*)
Creates a CD2DLayer.
Returns:
If the method succeeds, it returns S_OK. Otherwise, it returns an HRESULT error code.
pRenderTarget: A pointer to the render target.

CD2DLayer.Detach
Detaches resource interface from the object
Returns:
Pointer to detached resource interface.

CD2DLayer.Attach(ID2D1Layer*)
Attaches existing resource interface to the object
pResource: Existing resource interface. Cannot be NULL

CD2DLayer.op_Implicit~ID2D1Layer*
Returns ID2D1Layer interface
Returns:
Pointer to an ID2D1Layer interface or NULL if object is not initialized yet.

CD2DLayer.Get
Returns ID2D1Layer interface
Returns:
Pointer to an ID2D1Layer interface or NULL if object is not initialized yet.

CD2DLayer.IsValid
Checks resource validity
Returns:
TRUE if resource is valid; otherwise FALSE.

CD2DLayer.GetSize
Returns the size of the render target in device-independent pixels
Returns:
The current size of the render target in device-independent pixels

CD2DLayer.Dispose
The destructor. Called when a D2D layer object is being destroyed.

CD2DLayer.#ctor(CRenderTarget*,System.Int32)
Constructs a CD2DLayer object.
pParentTarget: A pointer to the render target.
bAutoDestroy: Indicates that the object will be destroyed by owner (pParentTarget).

CD2DLayer
ID2D1Layer wrapper.